app/views/circle/groups/index.html.erb

SELECT `users`.* FROM `users` INNER JOIN `group_users` ON `users`.`id` = `group_users`.`user_id` WHERE `group_users`.`group_id` = 1
---
          <ul class="unstyled">
            <% @group.users.each do |member| %>