app/controllers/circle/accounts_controller.rb

  def new
    @account = Account.new
    @group = Group.find(params[:group_id]) if params.has_key?(:group_id)
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1

  def create
      @group = Group.find(params[:group_id]) if params.has_key?(:group_id)
      @activity = Activity.find(params[:activity_id]) if params.has_key?(:activity_id)
      @account = @current_user.create_account(params[:account], @activity, @group)
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
INSERT INTO `accounts` (`created_at`, `genre_id`, `genre_type`, `io_type`, `owner_id`, `owner_type`, `paid_user_id`, `remark`, `sum`, `updated_at`, `user_id`, `visable_status`) VALUES ('2013-03-25 09:59:05', 3, 'Budget', 1, 1, 'Group', 2, '房屋中介', 1300.0, '2013-03-25 09:59:05', 2, 0)