app/controllers/circle/budgets_controller.rb

SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
---
  def new
    @activity = Activity.find(params[:activity_id]) if params.has_key?(:activity_id)
    @group = Group.find(params[:group_id]) if params.has_key?(:group_id)

SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
INSERT INTO `budgets` (`balance_sum`, `created_at`, `description`, `end_date`, `genre_id`, `genre_type`, `name`, `owner_id`, `owner_type`, `parent_id`, `start_date`, `status`, `total_sum`, `updated_at`, `user_id`, `visable_status`) VALUES (NULL, '2013-03-25 09:57:12', '够用了哟', '2013-04-30 00:00:00', NULL, NULL, '一个月生活费', 1, 'Group', NULL, '2013-04-01 00:00:00', 0, 1500.0, '2013-03-25 09:57:12', 2, 1)
---
  def create
    @group = Group.find(params[:group_id]) if params.has_key?(:group_id)
    @activity = Activity.find(params[:activity_id]) if params.has_key?(:activity_id)
    @budget = @group.create_budget(params[:budget], @current_user, @activity)