app/controllers/circle/groups_controller.rb

SELECT `groups`.* FROM `groups` ORDER BY `groups`.`id` DESC LIMIT 1
---
  def index
    @group = Group.last

SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
---
  def show
    @group = Group.find(params[:id])

INSERT INTO `groups` (`created_at`, `description`, `following_count`, `level`, `member_count`, `name`, `status`, `updated_at`, `user_id`, `visable_status`) VALUES ('2013-03-25 09:55:58', '一起吃喝拉撒', 0, 1, 0, '同住屋檐下', 0, '2013-03-25 09:55:58', 2, 0)
---
  def create
    @group = @current_user.create_group(params[:group])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
UPDATE `groups` SET `member_count` = 1, `updated_at` = '2013-03-25 09:55:58' WHERE `groups`.`id` = 1
---
  def set_admin
    user = User.find(params[:user_id])
    group = Group.find(params[:id])
    user.joined_group(group).update_attribute(:is_admin, true)