app/controllers/personal/accounts_controller.rb

  def index
    if params[:top_menu_type] == 'io_type'
      @top_menu_type = 'io_type'
      unless params[:io_type] == 'in_come'
        @accounts = @current_user.accounts.outcome.page(params[:page])
        @io_type = 'out_come'
      else
        @accounts = @current_user.accounts.income.page(params[:page])
        @io_type = 'in_come'
      end
    elsif params[:top_menu_type] == 'category_type'
      @top_menu_type = 'category_type'
      if params.has_key?(:category_id)
        category = Category.find(params[:category_id].to_i)
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 5 LIMIT 1

  def create
    # @account = Account.new(params[:account])
    if params.has_key?(:activity_id)
      @activity = Activity.find(params[:activity_id]) if params.has_key?(:activity_id)
      @account = @current_user.create_account(params[:account], @activity)
---
INSERT INTO `accounts` (`created_at`, `genre_id`, `genre_type`, `io_type`, `owner_id`, `owner_type`, `paid_user_id`, `remark`, `sum`, `updated_at`, `user_id`, `visable_status`) VALUES ('2013-03-25 09:44:12', 5, 'Category', 0, 2, 'User', NULL, '少了点哇', 800.0, '2013-03-25 09:44:12', 2, 0)