app/controllers/personal/budgets_controller.rb

  def index
    @budgets = @current_user.budgets.page(params[:page]).per(10)
---
SELECT `budgets`.* FROM `budgets`

  def new
    @activity = Activity.find(params[:activity_id]) if params.has_key?(:activity_id)
---
SELECT `activities`.* FROM `activities` WHERE `activities`.`id` = 1 LIMIT 1

  def create
    @activity = Activity.find(params[:activity_id]) if params.has_key?(:activity_id)
    @budget = @current_user.create_budget(params[:budget], @activity)
---
SELECT `activities`.* FROM `activities` WHERE `activities`.`id` = 1 LIMIT 1
INSERT INTO `budgets` (`balance_sum`, `created_at`, `description`, `end_date`, `genre_id`, `genre_type`, `name`, `owner_id`, `owner_type`, `parent_id`, `start_date`, `status`, `total_sum`, `updated_at`, `user_id`, `visable_status`) VALUES (NULL, '2013-03-25 09:49:57', '车/东西，杂七杂八的，搬家恼火哦', '2013-03-31 00:00:00', 1, 'Activity', '搬家总预算', 2, 'User', NULL, '2013-03-29 00:00:00', 0, 200.0, '2013-03-25 09:49:57', 2, 0)