app/controllers/users_controller.rb

  def create
    @user = User.create_init(params[:user],request.remote_ip)
---
INSERT INTO `users` (`access_token`, `brief_introduction`, `created_at`, `current_sign_in_at`, `current_sign_in_ip`, `email`, `follower_count`, `following_count`, `group_count`, `is_remember`, `last_sign_in_at`, `last_sign_in_ip`, `nick_name`, `password`, `permission`, `sign_in_count`, `status`, `token_updated_at`, `updated_at`) VALUES (NULL, 'I\'m the god of this system!', '2013-03-25 08:54:36', '2013-03-25 08:54:36', '127.0.0.1', 'zhongwenzhou.wolf@gamil.com', 0, 0, 0, 0, NULL, NULL, 'Tony', 'tonytone', 1, 1, 0, NULL, '2013-03-25 08:54:36')